glossary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-13 Thu 20:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Glossary</title>
<meta name="author" content="zfoteff" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="static/stylesheets/default-style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Glossary</h1>
<div class="org-center">
<p>
[<a href="dnd.html#ID-DND">Main Menu</a>]
</p>
</div>
<hr />
<p>
<span class="underline"><b>Charisma</b></span>: Measure of abilty to interact with others. It helps define a characters confidence and eloquence, and reflects a commanding personality. Applies in situations when the user is attempting to convincingly hide the truth, verbally or through actions, or intimidate other characters.
</p>

<p>
<span class="underline"><b>Class</b></span>: A archetype of skills and experience a user&rsquo;s character fits into. Every character will fit differently into the definition of a class, no single character can define a class in its entirety.
</p>

<p>
<span class="underline"><b>Constitution</b></span>: Measure of health, stamina, and vital force. Applies in situation checks where the character is pushed beyond their normal limits.
</p>

<p>
<span class="underline"><b>Dexterity</b></span>: Measure of agility, reflexes, and balance. Applies in situations where the user is attempting to move nimbly, quickly, quietly, or to keep their footing on tricky terrain.
</p>

<p>
<span class="underline"><b>Elemental Trait</b></span>: Inherent traits applied to a character, based on their subclass.
</p>

<p>
<span class="underline"><b>Intelligence</b></span>: Measure of mental acuity, accuracy of mental recall, and the ability to reason through complex situations. Applies in situations when a user must draw on logic, education, memory, or deductive reason.
</p>

<p>
<span class="underline"><b>Race</b>:</span> A class of beings that exist, or existed, in the game world.
</p>

<p>
<span class="underline"><b>Roll With Advantage</b></span>: Roll 2d20. Use the higher values.
</p>

<p>
<span class="underline"><b>Roll With Disadvantage</b></span>: Roll 2d20. Use the lower value.
</p>

<p>
<span class="underline"><b>Strength</b></span>: Measure of physical power, athletic training, and the extent to which a character can exert physical force with their body. Applies in situations where the character is attempting to lift, push, pull, or break something, to force your body through a space, or apply otherwise brute force to a situation.
</p>

<p>
<span class="underline"><b>Wisdom</b></span>: Measure of how attuned a person is to the world around them and represented perceptiveness and intuition. Applies in situation checks where a character tries to read body language, understand someone&rsquo;s feelings, notice things about the environment, or care for an injured person.
</p>
<hr />
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-07-05 Wed 00:00</p>
<p class="author">Author: zfoteff</p>
<p class="date">Created: 2023-07-13 Thu 20:05</p>
</div>
</body>
</html>
